CSI API ETABS v1
cDesignConcreteSlab Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignConcreteSlab
Public Interface cDesignConcreteSlab
Dim instance As cDesignConcreteSlab
public interface class cDesignConcreteSlab
type cDesignConcreteSlab =  interface end
The cDesignConcreteSlab type exposes the following members.
Properties
Name | Description
ACI318_14
DesignStrip
Top
Methods
Name | Description
GetFlexureAndShear
GetSummaryResultsFlexureAndShear
GetSummaryResultsSpanDefinition
StartSlabDesign
 Starts the concrete slab design.
Top
See Also
Reference
ETABSv1 Namespace